app/Controllers/Dosen.php

    public function index()
    {
        $data['dosen'] = $this->dosenModel->findAll();
---
SELECT *
FROM `dosen`