app/Controllers/mahasiswa.php

    public function index()
    {
        $data['mahasiswa'] = $this->mahasiswaModel->findAll();
---
SELECT *
FROM `mahasiswa`