app/Controllers/pegawai.php

SELECT *
FROM `pegawai`
---
    public function index()
    {
        $data['pegawai'] = $this->pegawaiModel->findAll();